# IFC_DMSetEntryType

## Description
Sets specified IfcEntry type - Primary/Secondary.

```pascal
FUNCTION IFC_DMSetEntryType(
				strObjectName : STRING;
				strEntryName  : STRING;
				type          : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_DMSetEntryType(strObjectName, strEntryName, type):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strObjectName|STRING||
|strEntryName|STRING||
|type|INTEGER||

## Version
Availability: from Vectorworks 2021
## Category
* IFC